Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The program will warn you if this length is exceeded.
ja: この長さを超えると、プログラムは警告を発します。

source: The progress bar displays progress status in a smooth scrolling bar instead of the default segmented bar.
ja: プログレスバーは、デフォルトの分割されたバーではなく、滑らかなスクロールバーで進行状況を表示します。

source: The progress bar displays progress status vertically, from bottom to top.
ja: プログレスバーは、進行状況を下から上に縦に表示する。

source: The progress bar moves like a marquee; that is, each change to its position causes the bar to slide further along its available length until it wraps around to the other side.
ja: プログレス・バーはマーキーのように動く。つまり、位置を変更するたびに、バーが反対側に回り込むまで、利用可能な長さに沿ってさらにスライドする。

source: The proper use of objects (and in particular, classes) can result in code which is modular and reusable.
ja: オブジェクト（特にクラス）を適切に使用することで、モジュール化された 再利用可能なコードを作成することができます。

source: The properties and methods of the wrapped object become available and the Ptr property becomes unavailable.
ja: ラップされたオブジェクトのプロパティとメソッドが利用可能になり、Ptrプロパティは利用不可能になります。

source: The properties window will automatically close when the script terminates.
ja: スクリプトが終了すると、プロパティウィンドウは自動的に閉じます。

source: The property name __Item is typically omitted, as shown above, but is used when overriding the property.
ja: プロパティ名 __Item は、上記のように通常は省略されますが、プロパティをオーバーライドする際に使用されます。

source: The property name to check for.
ja: チェックするプロパティ名です。

source: The property's name.
ja: プロパティの名前です。

source: The property's value.
ja: プロパティの値です。

source: The prototype object itself is natively an Object, but has no base and therefore does not identify as an instance of Object.
ja: プロトタイプオブジェクト自体は、本来Objectであるが、baseがないため、Objectのインスタンスとして識別しない。

source: The purpose of this is primarily to detect errors such as if (ex) break.
ja: これは主にif (ex) breakのようなエラーを検出するためです。

source: The question mark must be followed by one of the following symbols (ignoring whitespace):
ja: クエスチョンマークの後には、以下の記号のいずれかを続けなければならない（空白は無視する）：

source: The question mark must be followed by one of the following symbols (ignoring whitespace): )]},:.
ja: クエスチョンマークの後には、以下の記号のいずれかを続けなければならない（空白は無視する）：)]},:。

source: The quote mark is then included in the command line (i.e. the string that is passed to the Run function), whereas the back-tick, having fulfilled its purpose, is left out.
ja: このとき、引用符はコマンドライン（Run関数に渡される文字列）に含まれ、バックティックはその目的を果たした後、省かれる。

source: The range and meaning of character codes depends on which string encoding is in use.
ja: 文字コードの範囲と意味は、どの文字列エンコーディングが使用されているかによって異なります。

source: The range of possible values depends on the target window and the version of AutoHotkey that is running.
ja: 設定可能な値の範囲は、ターゲットウィンドウと実行中のAutoHotkeyのバージョンに依存します。

source: The range of valid return values depends on whether the exe running the script is 32-bit or 64-bit.
ja: 有効な戻り値の範囲は、スクリプトを実行するexeが32ビットか64ビットかによって異なります。

source: The rarely-used AStr* arg type is also supported and behaves similarly to the Str* type, except that any new string is converted from ANSI to the native format, UTF-16.
ja: まれに使われるAStr*arg型もサポートされており、新しい文字列がANSIからネイティブフォーマットであるUTF-16に変換される以外はStr*型と同様の動作をします。

source: The rarely-used Str* arg type passes the address of a temporary variable containing the address of the string.
ja: めったに使われないStr*arg型は、文字列のアドレスを含む一時変数のアドレスを渡します。

source: The rate at which characters are sent is determined by SetKeyDelay.
ja: 文字の送信速度はSetKeyDelay関数で定めます。

source: The rate at which keystrokes are sent is determined by SetKeyDelay.
ja: キー入力の送信速度は、SetKeyDelayで決定されます。

source: The read/write is automatically limited by Size (which is in bytes).
ja: 読み書きが自動的に制限されるのは、Size（単位はバイト）です。

source: The reader is not assumed to have any prior knowledge of scripting or programming, but should be prepared to learn new terminology.
ja: 読者に対してはスクリプトやプログラミングの予備知識を持つことは想定していませんが、新しい用語を学ぶ準備はしておいてください。

source: The region to be searched must be visible; in other words, it is not possible to search a region of a window hidden behind another window.
ja: 検索する領域は可視でなければなりません。言い換えれば、ウィンドウが他のウィンドウの後ろに隠れている領域を検索することは不可能です。

source: The relational operators <, <=, > and >= now throw an exception if used with a non-numeric string.
ja: 関係演算子<,<=,>,>=を数値以外の文字列で使用すると、例外が発生するようになりました。

source: The remaining items to the right of Pos are shifted to the left by Length (or 1 if omitted).
ja: Posの右にある残りの項目は、Length（省略時は1）だけ左にシフトされます。

source: The remaining output variables are handled like ByRef parameters (for which usage and syntax has changed), except that they permit references to writable built-in variables.
ja: 残りの出力変数は、書き込み可能な組み込み変数への参照を許可する以外は、ByRefパラメータ（使い方と構文が変更されている）と同様に扱われます。

source: The remaining parameters behave as per the Add method, except that Insert creates a new item even if NewItemName matches the name of an existing item.
ja: NewItemNameが既存のアイテム名と一致しても、Insertは新しいアイテムを作成することを除き、残りのパラメータはAddメソッドと同様に動作する。

source: The replacement string, or a function or function object to call (as a new thread) when the hotstring triggers.
ja: ホットストリングがトリガーされたときに（新しいスレッドとして）呼び出す置換文字列、または関数または関数オブジェクトです。

source: The requested capacity is too large to fit within any single contiguous memory block available to the script.
ja: 要求された容量が大きすぎて、スクリプトで使用可能な連続したメモリブロック1個に収まらない。

source: The required parameter n contains the number of variables in the for-loop, to allow it to affect enumeration without having to postpone initialization until the first iteration call.
ja: 必須パラメータnには、forループの変数数が含まれており、最初の反復呼び出しまで初期化を延期することなく、列挙に影響を与えることができます。

source: The resource ID to use.
ja: 使用するリソースID。

source: The rest of this paragraph applies to ListBox only.
ja: この段落の続きは、ListBoxのみに適用されます。

source: The rest period allows it to update itself and respond to the next function that the script may attempt to send to it.
ja: 休息期間中は、スクリプトが送信しようとする次の関数に対応するために、自身を更新することができます。

source: The result depends on the window (it may ask to save data, etc.)
ja: 結果はウィンドウに依存する（データの保存を求められるなど）。

source: The result has an additional null-terminator (binary zero) which is not included in the length.
ja: 結果には、長さに含まれないヌル・ターミネーター（2進数のゼロ）が追加される。

source: The result is a floating-point number.
ja: 結果は、浮動小数点数です。

source: The result is a string like "ahk_pid 1040", but the number isn't predictable.
ja: 結果は「ahk_pid 1040」のような文字列になりますが、数字は予測できません。

source: The result is always rounded down to the nearest integer.
ja: 結果は常に最も近い整数に切り捨てられる。

source: The result is an integer if N is omitted or less than 1.
ja: Nが省略された場合、または1より小さい場合は、結果は整数となります。

source: The result is inverted by applying the logical-not operator (! or not).
ja: 結果は、論理not演算子（!またはnot）を適用して反転させる。

source: The result may be inverted with not or !, but no other operators may be used.
ja: notや !で結果を反転させることができるが、それ以外の演算子は使用できない。

source: The result of !0 is 1, so when WinWait times out, the if statement executes the return.
ja: !0の結果は1なので、WinWaitがタイムアウトしたときにif文でreturnを実行します。

source: The result of a multi-statement expression such as x(), y() is the last (right-most) sub-expression instead of the first (left-most) sub-expression.
ja: x(), y()のような複数文の式の結果は、最初の（一番左の）部分式ではなく、最後の（一番右の）部分式になります。

source: The retrieved coordinates are relative to the active window unless CoordMode was used to change to screen coordinates.
ja: 取得された座標は、CoordModeでスクリーン座標に変更されていない限り、アクティブウィンドウからの相対座標となります。

source: The retrieved coordinates are relative to the active window's client area unless CoordMode was used to change to screen coordinates.
ja: 取得した座標は、CoordMode関数で変更されない限りアクティブウィンドウのクライアント領域を基準にします。

source: The retrieved coordinates are relative to the active window's client area unless overridden by using CoordMode or A_CoordModeCaret.
ja: 座標は、CoordModeまたはA_CoordModeCaretを使用して上書きされない限り、アクティブウィンドウのクライアント領域からの相対座標となります。

source: The return value can be assigned to a variable as shown above, or it can be used directly as shown below:
ja: 戻り値は、上記のように変数に代入することもできますし、以下のように直接使用することもできます：

source: The return value depends on the value of InfoType.
ja: 戻り値は、InfoTypeの値に依存します。

source: The return value depends on the value of Param2:
ja: 戻り値は、Param2の値に依存します。

source: The return value is 1 (true) if Var or the variable represented by Ref has been assigned a value, otherwise 0 (false).
ja: 戻り値は、VarまたはRefで表される変数に値が割り当てられている場合は 1（真）、それ以外の場合は 0（偽）である。

source: The return value is a Buffer object if the RAW option is in effect and the file can be opened; otherwise, it is a string.
ja: 戻り値は、RAWオプションが有効でファイルを開くことができる場合はBufferオブジェクト、それ以外の場合は文字列です。

source: The return value is a new File object encapsulating the open handle to the file.
ja: 戻り値は、ファイルへのオープンハンドルをカプセル化した新しいFileオブジェクトです。

source: The return value is an empty string if the window has no transparency level, or under other conditions (caused by OS behavior) such as the window having been minimized, restored, and/or resized since it was made transparent.
ja: ウィンドウに透明レベルがない場合、またはウィンドウが透明になってから最小化、復元、サイズ変更されたなどの他の条件下（OSの動作によって引き起こされる）では、戻り値は空の文字列です。

source: The return value is an empty string if:
ja: 以下の場合、戻り値は空文字列となる：

source: The return value is an empty string in the following cases:
ja: 次の場合、戻り値は空文字列になります：

source: The return value is ignored by the control.
ja: 戻り値は、制御によって無視されます。

source: The return value is the name of the button, without spaces.
ja: 戻り値は、空白を除いたボタン名です。

source: The return value is the same type as Number (integer or floating point).
ja: 戻り値は、Numberと同じ型（整数または浮動小数点）です。

source: The return value is the setting which was in effect before the function was called.
ja: 戻り値は、この関数が呼び出される前に有効であった設定値です。

source: The return value may have additional meaning for specific events.
ja: 戻り値は、特定のイベントに対して追加の意味を持つ場合があります。

source: The return value may have additional meaning, depending on the notification.
ja: 戻り値は、通知によって追加の意味を持つ場合があります。

source: The return value of __New is now ignored; to override the return value, do so from the Call method.
ja: __Newの戻り値は無視されるようになりました。戻り値をオーバーライドする場合は、Callメソッドから行ってください。

source: The return value of set is ignored.
ja: setの戻り値は無視される。

source: The return value of a property setter is now ignored.
ja: プロパティセッターの戻り値は無視されるようになりました。

source: The return value will be retrieved instantly, because the control keeps track of the count.
ja: コントロールがカウントを記録しているため、戻り値は即座に取得される。

source: The return value will be retrieved instantly, because the control keeps track of these counts.
ja: コントロールがこれらのカウントを記録しているため、戻り値は即座に取得されます。

source: The returned array can have zero or more elements.
ja: 返された配列は、0個以上の要素を持つことができます。

source: The returned handle is valid only until the Win32 menu is destroyed, which typically occurs when the Menu object is freed.
ja: 返されたハンドルは、Win32メニューが破棄されるまで有効であり、通常Menuオブジェクトが解放されたときに発生する。

source: The returned object contains one own property per named control, like NamedCtrlContents.%GuiCtrl.Name% := GuiCtrl.Value, with the exceptions noted below.
ja: 返されたオブジェクトは、NamedCtrlContents.%GuiCtrl.Name% := GuiCtrl.Valueのように、名前付きコントロールごとに1つの独自のプロパティを含みますが、以下に示す例外はあります。

source: The returned string is always a vkNNscNNN sequence if enabled or "" if disabled, regardless of how it was assigned.
ja: 返される文字列は、どのように割り当てられたかに関わらず、有効な場合は常にvkNNscNNNシーケンス、無効な場合は""となる。

source: The returned string is always a vkNNscNNN sequence if enabled or blank if disabled, regardless of how it was assigned.
ja: 返される文字列は、どう割り当てられたかにかかわらず、有効な場合は常に vkNNscNNN の形式になり、無効な場合は空白になります。

source: The reverse is also possible, i.e. marking a code section to only be executed in the compiled script:
ja: その逆も可能である。つまり、コンパイルされたスクリプトでのみ実行されるコードセクションをマークするのである：

source: The reverse is also true:
ja: 逆もまた然りである：

source: The reverse is also true: it will not be necessary to check for A_IsCompiled because the code is inside a comment block in the uncompiled script.
ja: 逆もまた然りである：このコードは、コンパイルされていないスクリプトのコメント・ブロック内にあるので、A_IsCompiledをチェックする必要はない。

source: The reverse translation was already done when calling COM methods in previous versions.
ja: 逆変換は、以前のバージョンでCOMメソッドを呼び出すときにすでに行われていた。

source: The right pointing arrow in Winspector Spy shows the msg values and the blurred left pointing arrows show the returned value.
ja: Winspector Spy の右向きの矢印は msg の値を示し、ぼかした左向きの矢印は返された値を示しています。

source: The root (starting) directory, which is assumed to be a subfolder in A_WorkingDir if an absolute path is not specified.
ja: ルート（開始）ディレクトリ。絶対パスが指定されていない場合は、A_WorkingDirのサブフォルダとみなされます。

source: The row number for the newly inserted row.
ja: 新たに挿入された行の行番号。

source: The row number of the clicked item, or 0 if the mouse was not over an item.
ja: クリックされた項目の行番号、またはマウスが項目上にない場合は0を指定します。

source: The row number of the newly inserted row.
ja: 新たに挿入された行の行番号。

source: The row to delete.
ja: 削除する行を指定します。

source: The row to modify.
ja: 修正する行を指定します。

source: The rudder or 4th axis of the joystick.
ja: ジョイスティックのラダーまたは第4軸。

source: The rules are as follows.
ja: ルールは以下の通りです。

source: The same wrapper object is returned each time.
ja: 毎回、同じラッパーオブジェクトが返されます。

source: The same as mode 1 above except that the limitation is absent.
ja: 限定がないことを除き、上記モード1と同じです。

source: The same compiler is used for v1.1 and v2 scripts.
ja: v1.1とv2のスクリプトには同じコンパイラが使用される。

source: The same function could be reused to write information to some other target, such as a TCP/IP socket or WebSocket (via user-defined objects).
ja: 同じ関数を再利用して、TCP/IPソケットやWebSocketなどの他のターゲットに情報を書き込むことができます（ユーザー定義オブジェクト経由）。

source: The same hotkey can be used multiple times by specifying a different condition for each occurrence of the hotkey, or each hotkey variant.
ja: ホットキーが出現するたびに、またはホットキーのバリエーションごとに異なる条件を指定することで、同じホットキーを複数回使用することができます。

source: The same is true for mouse buttons when the mouse hook is not installed.
ja: マウスフック未装着時のマウスボタンも同様です。

source: The same is true for the destination key except that it may optionally specify a scan code after the virtual key.
ja: デスティネーション・キーについても同様であるが、バーチャル・キーの後にスキャン・コードを指定することもできる。

source: The same is true if the source is the right Ctrl, except that {RCtrl up} is used.
ja: ソースが右Ctrlの場合も、{RCtrl up}が使われる以外は同じである。

source: The same syntax is used as for normal function calls; the only apparent difference is that certain error-checking is performed at load time for non-dynamic calls but only at run time for dynamic calls.
ja: 通常の関数呼び出しと同じ構文が使用されます。唯一の明らかな違いは、非動的呼び出しではロード時に特定のエラーチェックが実行されますが、動的呼び出しでは実行時にのみ実行されることです。

source: The same thing happens if the function Exits or causes a runtime error such as running a nonexistent file.
ja: 関数がExitしたり、存在しないファイルを実行するなどのランタイムエラーが発生した場合も同様です。

source: The same thing happens if the function is exited because of Throw or a runtime error (such as running a nonexistent file).
ja: Throwやランタイムエラー（存在しないファイルを実行したなど）により、関数が終了した場合も同様です。

source: The script calls IL_Add repeatedly to add icons to the list, and each icon is assigned a sequential number starting at 1.
ja: スクリプトはIL_Addを繰り返し呼び出してアイコンをリストに追加し、各アイコンには1から始まる連番が割り当てられています。

source: The script can also assign a key name, vkNN sequence or scNNN sequence, in which case generally either the VK or SC code is left as zero until the key is sent, then determined automatically.
ja: スクリプトは、キー名、vkNNシーケンス、scNNNシーケンスを割り当てることもでき、この場合、一般にキーが送信されるまでVKまたはSCコードのどちらかがゼロのままとされ、その後自動的に決定されます。

source: The script can also define new value properties, which act as default property values for all instances.
ja: スクリプトは、すべてのインスタンスのデフォルトのプロパティ値として機能する、新しい値のプロパティを定義することもできます。

source: The script can also retain the variable notepad_id for later use, such as to close or reactivate the window or move it somewhere else.
ja: また、スクリプトは、ウィンドウを閉じたり、再アクティブ化したり、別の場所に移動させるなど、後で使用するために変数 notepad_idを保持することができます。

source: The script can determine whether a property is dynamic by checking not desc.HasProp("Value"), where desc is the return value of GetOwnPropDesc.
ja: スクリプトは、not desc.HasProp("Value") をチェックすることによって、プロパティが動的かどうかを判断することができます。descは、GetOwnPropDescの戻り値です。

source: The script can force this to take place immediately by calling Sleep -1.
ja: スクリプトは、Sleep -1を呼び出すことで、これを直ちに強制的に実行させることができます。

source: The script can register an OnChar function to be called whenever a character is added, instead of continuously checking the Input property.
ja: スクリプトは、Inputプロパティを継続的にチェックする代わりに、文字が追加されるたびに呼び出されるOnChar関数を登録することができます。

source: The script compiler looks for special comments in the source script and recognises these as Compiler Directives.
ja: スクリプトコンパイラは、ソーススクリプト内の特別なコメントを探し、コンパイラディレクティブとして認識します。

source: The script has the keyboard hook installed (you can see if your script uses the hook via the "View->Key history" menu item in the main window, or via the KeyHistory function).
ja: スクリプトにキーボードフックがインストールされている（スクリプトがフックを使用しているかどうかは、メインウィンドウの「View->Key history」メニュー項目、またはKeyHistory関数で確認することができます）。

source: The script is automatically persistent while an Input is in progress, so it will continue monitoring input even if there are no running threads.
ja: このスクリプトは、入力が進行している間は自動的に永続化されるため、実行中のスレッドがない場合でも入力の監視を継続します。

source: The script is paused and suspended.
ja: スクリプトは一時停止され、中断されます。

source: The script is paused.
ja: スクリプトは一時停止される。

source: The script is suspended.
ja: スクリプトは中断されている。

source: The script is being reloaded via the Reload function or menu item.
ja: スクリプトは、リロード機能またはメニュー項目によって再読み込みされています。

source: The script is being replaced by a new instance of itself as a result of #SingleInstance.
ja: スクリプトは、#SingleInstanceの結果、自分自身の新しいインスタンスに置き換えられています。

source: The script is monitoring the WM_HELP message (0x0053).
ja: スクリプトはWM_HELPメッセージ(0x0053)を監視しています。

source: The script is uninterruptible as a result of Critical or Thread "Interrupt/Priority".
ja: CriticalまたはThread "Interrupt/Priority"の結果、スクリプトは中断されない。

source: The script is uninterruptible as a result of Critical or Thread Interrupt/Priority.
ja: CriticalまたはThread Interrupt/Priorityの結果、スクリプトは中断されない。

source: The script may change the value of the string indirectly by passing the address to NumPut, DllCall or SendMessage.
ja: スクリプトは、NumPut、DllCall、またはSendMessageにアドレスを渡すことで、間接的に文字列の値を変更することができる。

source: The script may exit automatically when input ends (if there are no running threads and the script is not persistent for some other reason).
ja: 入力が終了すると、スクリプトは自動的に終了することがあります（実行中のスレッドがなく、他の理由でスクリプトが永続的でない場合）。

source: The script may implement an enumerator to control which values are assigned to the for-loop's variables on each iteration of the loop.
ja: スクリプトは、ループの各反復において、どの値をforループの変数に割り当てるかを制御するために、列挙者を実装することができる。

source: The script must also inform the object when it is finished with that reference:
ja: スクリプトはまた、その参照を終了するときにオブジェクトに通知しなければならない：

source: The script must register for each event of interest by calling the OnEvent method of the Gui or GuiControl.
ja: スクリプトは、GuiまたはGuiControlのOnEventメソッドを呼び出して、関心のある各イベントに登録する必要があります。

source: The script must retain a reference to ComObj, otherwise it would be freed automatically and would disconnect from its COM object, preventing any further events from being detected.
ja: スクリプトはComObjへの参照を保持する必要があります。そうしないと、自動的に解放され、COMオブジェクトから切断され、それ以降のイベントが検出されなくなるからです。

source: The script should not attempt to modify the string.
ja: スクリプトは文字列を変更しようとしてはならない。

source: The script terminates.
ja: スクリプトは終了する。

source: The script waits for the sound to finish before continuing.
ja: スクリプトは、音が鳴り終わるのを待ってから続行します。

source: The script was sent a WM_CLOSE or WM_QUIT message, had a critical error, or is being closed in some other way.
ja: スクリプトにWM_CLOSEまたはWM_QUITメッセージが送信されたか、クリティカルエラーが発生したか、または他の方法で終了しています。

source: The script will always exit, even if MyVar is not 5:
ja: MyVarが5でなくても、スクリプトは常に終了する：

source: The script will terminate after completing startup if it lacks hotkeys, hotstrings, visible GUIs, active timers, clipboard monitors and InputHooks, and has not called the Persistent function.
ja: ホットキー、ホットストリング、表示可能なGUI、アクティブタイマー、クリップボードモニター、InputHooksがなく、Persistent関数を呼び出していない場合、スクリプトは起動完了後に終了します。

source: The script will then continue until reaching the next "break point" (if any).
ja: スクリプトは、次の「ブレークポイント」に達するまで続けられる（もしあれば）。

source: The script's main window is closed (but destroying it causes the script to exit regardless of persistence, as before).
ja: スクリプトのメインウィンドウが閉じられます（ただし、破壊すると従来通りパーシスタンスに関係なくスクリプトが終了します）。

source: The script's initial working directory, which is determined by how it was launched.
ja: スクリプトの初期作業ディレクトリで、スクリプトの起動方法によって決まる。

source: The script's main window is usually hidden, but can be shown via the tray icon or one of the functions listed below to gain access to information useful for debugging the script.
ja: スクリプトのメインウィンドウは通常非表示になっていますが、トレイアイコンまたは以下に示す関数のいずれかを使用して表示すると、スクリプトのデバッグに役立つ情報にアクセスできます。

source: The script's own windows can't be automated by non-UIA programs/scripts for security reasons.
ja: スクリプト自身のウィンドウは、セキュリティ上の理由から、UIA以外のプログラム/スクリプトによって自動化することはできません。

source: The script's working directory defaults to A_ScriptDir, regardless of how the script was launched.
ja: スクリプトの起動方法に関係なく、スクリプトの作業ディレクトリの初期値はA_ScriptDirです。

source: The script's working directory is the default directory that is used to access files and folders when an absolute path has not been specified.
ja: スクリプトの作業ディレクトリは、絶対パスが指定されていない場合にファイルやフォルダにアクセスするために使用されるデフォルトのディレクトリです。

source: The search behavior may vary depending on the display adapter's color depth (especially for GIF and JPG files).
ja: ディスプレイアダプターの色深度により、検索動作が異なる場合があります（特にGIFファイル、JPGファイル）。

source: The search is case insensitive according to the rules of the current user's locale.
ja: 検索は、現在のユーザーのロケールの規則に従って、大文字と小文字を区別しません。

source: The search is case sensitive.
ja: 検索は大文字と小文字を区別します。

source: The search is case-insensitive according to the rules of the current user's locale, and stops at the first matching item.
ja: 検索は、現在のユーザーのロケールの規則に従って大文字と小文字を区別せず、最初に一致した項目で停止します。

source: The search is case-insensitive according to the rules of the current user's locale.
ja: 検索は、現在のユーザーのロケールのルールに従って、大文字と小文字を区別しない。

source: The search is case-insensitive.
ja: 大文字と小文字を区別して検索します。

source: The search is case-sensitive.
ja: 検索では大文字と小文字が区別されます。

source: The search is conducted from right to left if StartingPos is negative; otherwise it is conducted from left to right.
ja: StartingPos が負の場合は右から左へ、そうでないときはは左から右へ検索されます。

source: The search is not case sensitive.
ja: 検索では、大文字と小文字は区別されません。

source: The search is not case-sensitive, i.e. the letters A-Z are considered identical to their lowercase counterparts.
ja: 検索では大文字と小文字が区別されないため、A-Z の文字は小文字の文字と同一と見なされます。

source: The search is not case-sensitive.
ja: 検索では、大文字と小文字は区別されません。

source: The search order depends on the order of the parameters.
ja: 検索順序は、パラメータの順序に依存します。

source: The search starts at the coordinates specified by X1 and Y1 and checks all pixels in the row from X1 to X2 for a match.
ja: X1とY1で指定された座標から検索を開始し、X1からX2までの行のすべてのピクセルが一致するかどうかをチェックします。

source: The second Return is redundant when used at the end of a function like this.
ja: 2番目のReturnは、このように関数の最後に使うと冗長です。

source: The second click must occur within this rectangle for the system to consider the two clicks a double-click.
ja: システムが2回のクリックをダブルクリックとみなすには、2回目のクリックがこの矩形内で行われなければならない。

source: The second item.
ja: ２つ目の項目。

source: The second member is at offset 0 plus the size of the first member (typically 4).
ja: 第2部材は、オフセット0に第1部材の大きさ（通常4）を加えた位置にある。

source: The second parameter becomes the window title.
ja: 2番目のパラメータはウィンドウのタイトルになります。

source: The second parameter is a string indicating the type information to retrieve.
ja: 第2パラメータには、取得する型情報を示す文字列を指定します。

source: The second parameter was removed.
ja: 第2パラメータを削除しました。

source: The second version string to be compared, optionally prefixed with one of the following operators:
ja: 比較する2番目のバージョン文字列で、オプションで先頭に以下の演算子のいずれかを付ける：

source: The second version string to be compared, optionally prefixed with one of the following operators: <, <=, >, >= or =.
ja: 比較する2番目のバージョン文字列で、オプションで先頭に以下の演算子のいずれかを付ける：<、<=、>、>=または=。

source: The section name in the .ini file, which is the heading phrase that appears in square brackets (do not include the brackets in this parameter).
ja: .iniファイル内のセクション名で、角括弧内に表示される見出し語です（このパラメータに括弧は含めないでください）。
